{
  "intro": {
    "description": "🧙 You awaken in a moss-covered stone circle. Fog drips from twisted trees. A raven stares.\nYour only belongings: a rusty dagger, a torn map, and a faint headache that feels... cursed.",
    "choices": {
      "Examine the map": "map_scene",
      "Talk to the raven": "raven_scene",
      "Walk into the forest": "forest_path"
    }
  },
  "map_scene": {
    "description": "📜 The map shows a ruin labeled 'Whispering Vault' and a trail marked with cryptic runes.",
    "choices": {
      "Follow the trail": "forest_path",
      "Return to the stone circle": "intro"
    }
  },
  "raven_scene": {
    "description": "🪶 The raven cocks its head. In a raspy human voice it says: 'Three paths, one truth. Don't trust the smiling god.'",
    "choices": {
      "Demand more answers": "raven_mystery",
      "Back away slowly": "intro"
    }
  },
  "raven_mystery": {
    "description": "🦉 The raven screeches and bursts into black feathers. A silver key is left behind.",
    "choices": {
      "Take the key and head to the forest": "forest_path"
    }
  },
  "forest_path": {
    "description": "🌲 The forest path splits ahead. One way leads to light and laughter. The other, to silence and cold shadows.",
    "choices": {
      "Take the bright path": "bright_path",
      "Take the dark path": "dark_path"
    }
  },
  "bright_path": {
    "description": "🌞 Warm light filters through golden leaves. You hear music, distant and cheerful. A small cottage lies ahead.\nAn old man sits outside, whittling a flute from bone. His smile doesn't reach his eyes.",
    "choices": {
      "Speak to the old man": "light_mystery",
      "Ignore him and walk past": "END"
    }
  },
  "dark_path": {
    "description": "🌑 The air grows colder. Trees groan like dying things. You find a ruined shrine where an old man in rags tends a flickering blue flame.\nHis eyes are milky, but he speaks before you do: 'I saw you in the ashes.'",
    "choices": {
      "Ask what he means": "dark_mystery",
      "Back away into the forest": "END"
    }
  },
  "light_mystery": {
    "description": "🎵 The old man chuckles. 'So you've heard the laughter too. Most think it's the fairfolk — it's not.'\n'The Whispering Vault opens soon. When it does, not even gods will sleep safe.'",
    "choices": {
      "Ask about the Whispering Vault": "END"
    }
  },
  "dark_mystery": {
    "description": "🕯 The blind man dips his finger into the blue flame and draws a sigil in the air. It burns into your vision.\n'You were marked at birth. The Vault remembers. And it waits.'",
    "choices": {
      "Stare into the flame": "END"
    }
  }
}

